Revit 2027 API
InitialLuminousIntensity(InitialLuminousIntensity) Constructor
 Creates a copy of the given initial luminous intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialLuminousIntensity(
	InitialLuminousIntensity other
)
Public Sub New (
	other As InitialLuminousIntensity
)
public:
InitialLuminousIntensity(
	InitialLuminousIntensity^ other
)
new :
        other : InitialLuminousIntensity -> InitialLuminousIntensity
Parameters
other InitialLuminousIntensity
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InitialLuminousIntensity Class
InitialLuminousIntensity Overload
Autodesk.Revit.DB.Lighting Namespace